Revit 2027 API
Element.GetExternalResourceReferenceExpanded Method
 Gets the collection of ExternalResourceReference associated with a specified external resource type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExternalResourceReference> GetExternalResourceReferenceExpanded(
	ExternalResourceType resourceType
)
Public Function GetExternalResourceReferenceExpanded (
	resourceType As ExternalResourceType
) As IList(Of ExternalResourceReference)
public:
IList<ExternalResourceReference^>^ GetExternalResourceReferenceExpanded(
	ExternalResourceType^ resourceType
)
member GetExternalResourceReferenceExpanded :
        resourceType : ExternalResourceType -> IList<ExternalResourceReference>
Parameters
resourceType ExternalResourceType
 The desired external resource type.
Return Value
IList<ExternalResourceReference>
 The collection of the ExternalResourceReference associated with a specified external resource type.
Exceptions
Exception | Condition
ArgumentException |  This Element does not use a resource reference for the specified resource type.
ArgumentNullException |  A non-optional argument was null
Remarks
 Use this API for an element which has multiple external resource references under a specified type, e.g., AppearanceAssetElement. See also: [!:Autodesk::Revit::DB::Element::getExternalResourceReference].
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace